#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```hcl
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infra/terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/cloudops-practice/cloudops-practice/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/cloudops-practice/cloudops-practice

To view this run in a browser, visit:
https://app.terraform.io/app/andrewdq/cloudops-practice/runs/run-BCauddKS2BFfEH6X

Waiting for the plan to start...

Terraform v1.12.2
on linux_amd64
Initializing plugins and modules...
module.alerts.data.azurerm_subscription.current: Reading...
data.azurerm_client_config.current: Reading...
module.resource_groups["southeastasia"].azurerm_resource_group.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg]
module.resource_groups["eastasia"].azurerm_resource_group.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0xMjIwMzZjMi02YTQ4LTQxODAtYWUyZC1jZmEwZjIzZTBkZjA7b2JqZWN0SWQ9MWRlYmU3NTItZDJhZS00ZTI1LTljMjUtNzc4ZTkzM2U1ZmMwO3N1YnNjcmlwdGlvbklkPTY5NDIxYTAzLWY4ZTYtNGExZS04MWIzLTA3N2FhZWVhNWNlNzt0ZW5hbnRJZD0xNGJhMzgwYi1iOTNhLTRmYzEtYjRlZi04MDM5Y2NhNjFkNzU=]
data.azuread_service_principal.current: Reading...
data.azuread_service_principal.current: Read complete after 0s [id=1debe752-d2ae-4e25-9c25-778e933e5fc0]
module.alerts.data.azurerm_subscription.current: Read complete after 1s [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7]
azurerm_postgresql_flexible_server.primary: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql]
module.secondary_network.azurerm_virtual_network.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-secondary-vnet]
module.primary_network.azurerm_virtual_network.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet]
module.alerts.azurerm_monitor_action_group.alerts: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Insights/actionGroups/ag-roadmap-maker]
module.secondary_network.azurerm_network_security_group.aks_nsg[0]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/networkSecurityGroups/roadmap-maker-secondary-vnet-aks-nsg]
module.primary_network.azurerm_network_security_group.aks_nsg[0]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/networkSecurityGroups/roadmap-maker-primary-vnet-aks-nsg]
module.alerts.azurerm_consumption_budget_subscription.budget: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/providers/Microsoft.Consumption/budgets/roadmap-maker-annual-budget]
module.primary_network.azurerm_subnet.subnets["aks"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet/subnets/aks]
module.primary_network.azurerm_subnet.subnets["app"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet/subnets/app]
module.secondary_network.azurerm_subnet.subnets["aks"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-secondary-vnet/subnets/aks]
module.secondary_network.azurerm_subnet.subnets["app"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-secondary-vnet/subnets/app]
azurerm_postgresql_flexible_server_firewall_rule.azure_services: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/firewallRules/AllowAzureServices]
azurerm_postgresql_flexible_server_database.primary: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/databases/roadmap_maker]
azurerm_postgresql_flexible_server_firewall_rule.aks_subnet: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/firewallRules/AllowAKSSubnet]
azurerm_postgresql_flexible_server_active_directory_administrator.primary: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/administrators/1debe752-d2ae-4e25-9c25-778e933e5fc0]
module.primary_network.azurerm_subnet_network_security_group_association.aks_nsg_association[0]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet/subnets/aks]
module.secondary_network.azurerm_subnet_network_security_group_association.aks_nsg_association[0]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-secondary-vnet/subnets/aks]
module.primary_aks.azurerm_kubernetes_cluster.default: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.ContainerService/managedClusters/roadmap-maker-primary-aks]
module.secondary_aks.azurerm_kubernetes_cluster.default: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.ContainerService/managedClusters/roadmap-maker-secondary-aks]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_traffic_manager_external_endpoint.primary will be created
  + resource "azurerm_traffic_manager_external_endpoint" "primary" {
      + always_serve_enabled = false
      + enabled              = true
      + endpoint_location    = "southeastasia"
      + id                   = (known after apply)
      + name                 = "primary-endpoint"
      + priority             = 1
      + profile_id           = (known after apply)
      + target               = "20.195.4.246"
      + weight               = (known after apply)
    }

  # azurerm_traffic_manager_external_endpoint.secondary will be created
  + resource "azurerm_traffic_manager_external_endpoint" "secondary" {
      + always_serve_enabled = false
      + enabled              = true
      + endpoint_location    = "eastasia"
      + id                   = (known after apply)
      + name                 = "secondary-endpoint"
      + priority             = 2
      + profile_id           = (known after apply)
      + target               = "20.247.48.160"
      + weight               = (known after apply)
    }

  # azurerm_traffic_manager_profile.tm_profile will be created
  + resource "azurerm_traffic_manager_profile" "tm_profile" {
      + fqdn                   = (known after apply)
      + id                     = (known after apply)
      + name                   = "roadmap-tm"
      + profile_status         = (known after apply)
      + resource_group_name    = "roadmap-maker-southeastasia-rg"
      + tags                   = {
          + "application" = "roadmap-maker"
          + "environment" = "prod"
          + "managed-by"  = "terraform"
          + "project"     = "cloudops-practice"
        }
      + traffic_routing_method = "Priority"

      + dns_config {
          + relative_name = "roadmap-tm"
          + ttl           = 30
        }

      + monitor_config {
          + interval_in_seconds          = 30
          + path                         = "/"
          + port                         = 443
          + protocol                     = "HTTPS"
          + timeout_in_seconds           = 10
          + tolerated_number_of_failures = 3
        }
    }

  # module.primary_aks.azurerm_kubernetes_cluster.default will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "default" {
        id                                  = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.ContainerService/managedClusters/roadmap-maker-primary-aks"
        name                                = "roadmap-maker-primary-aks"
        tags                                = {
            "application"  = "roadmap-maker"
            "cluster-type" = "primary"
            "environment"  = "prod"
            "managed-by"   = "terraform"
            "project"      = "cloudops-practice"
            "region"       = "primary"
        }
        # (40 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {
                "application"  = "roadmap-maker"
                "cluster-type" = "primary"
                "environment"  = "prod"
                "managed-by"   = "terraform"
                "project"      = "cloudops-practice"
                "region"       = "primary"
            }
            # (33 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.secondary_aks.azurerm_kubernetes_cluster.default will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "default" {
        id                                  = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.ContainerService/managedClusters/roadmap-maker-secondary-aks"
        name                                = "roadmap-maker-secondary-aks"
        tags                                = {
            "application"  = "roadmap-maker"
            "cluster-type" = "secondary"
            "environment"  = "prod"
            "managed-by"   = "terraform"
            "project"      = "cloudops-practice"
            "region"       = "secondary"
        }
        # (40 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {
                "application"  = "roadmap-maker"
                "cluster-type" = "secondary"
                "environment"  = "prod"
                "managed-by"   = "terraform"
                "project"      = "cloudops-practice"
                "region"       = "secondary"
            }
            # (33 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 3 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + traffic_manager_profile_fqdn = (known after apply)
  + traffic_manager_profile_name = "roadmap-tm"

```

</details>

*Pushed by: @AndrewDoan01, Action: `pull_request`*